import java.util.Arrays;
import java.util.Scanner;

public class E26_Quest {

	public static void main(String[] args) {
//		정수형 배열 생성, 길이10
		int[] arr = new int[10];
//		입력수 arr배열에 추가 할 변수
		int idx = 0;
//		Scanner 생성
		Scanner sc = new Scanner(System.in);
//		반복문 - 무한 루프
//------------------------------------------------------------------------------------------------------------------------------------
		while(true) {
			System.out.println("1 - 숫자 추가");
			System.out.println("2 - 숫자 삭제");
			System.out.println("3 - 전체 숫자 출력");
			System.out.println("0 - 프로그램 종료");
			System.out.print("원하시는 번호를 입력 하세요 : ");
			int no = sc.nextInt();
//------------------------------------------------------------------------------------------------------------------------------------
			if(no == 0) { // 0 - 프로그램 종료
				System.out.println("프로그램을 종료 합니다.");
				break;
//------------------------------------------------------------------------------------------------------------------------------------				
			}else if(no == 1) { // 1 - 숫자 추가
//				3. 단 배열에 저장할 공간이 없으면 배열길이 5씩 늘린 후에 저장
//				배열에 저장할 공간이 없으면 배열 길이 5씩 늘리는 if문
				if(idx == arr.length) {
//					추가로 늘려 새로 저장할 변수 선언
					int temp[] = new int[arr.length+5];
//					배열 내용 복사
					System.arraycopy(arr, 0, temp, 0, arr.length);
//					배열 연결
					arr = temp;
					}
//				1. 숫자 입력 받아서
				System.out.println("-추가할 숫자 입력 : ");
//				2. 배열에 추가
				arr[idx++] = sc.nextInt();
//------------------------------------------------------------------------------------------------------------------------------------
			}else if(no == 2) { // 2 - 숫자 삭제
//				삭제할 데이터 입력
				System.out.println("--------------------------------------------------------------------------------------------------");
				System.out.print("-입력된 데이터 : ");
				for(int i = 0; i < idx; i++) {
					System.out.print(arr[i] + " ");
				}
				System.out.println();
				System.out.println("--------------------------------------------------------------------------------------------------");
				System.out.print("-삭제할 숫자 입력 : " );
				int n = sc.nextInt();
				System.out.println("--------------------------------------------------------------------------------------------------");
//				삭제할 데이터를 찾음
				boolean flag = false;
				for(int i = 0; i < idx; i++) {
					if (arr[i] == n) {
						flag = true;
						for (int j = i; j < idx - 1; j++) {
							arr[j] = arr[j + 1];
						}
						idx--;
						break;
					}
					
				}
				
//				1. 삭제할 데이터가 있는 경우 데이터를 한깐씩 땡겨옴
//					'데이터 삭제 완료' 출력
				if(flag) {
					System.out.println("데이터 삭제 완료.");
					System.out.println("--------------------------------------------------------------------------------------------------");
				}else {
//				2. 삭제할 데이터가 없는 경우 '삭제할 데이터가 없습니다.' 출력
					System.out.println("삭제할 데이터가 없습니다.");
					System.out.println("--------------------------------------------------------------------------------------------------");
				}
				
//------------------------------------------------------------------------------------------------------------------------------------
			}else if(no == 3) { // 3 - 입력데이터 확인
				System.out.println("--------------------------------------------------------------------------------------------------");
				System.out.print("-입력하신 전체 데이터 숫자 : ");
				for(int i = 0; i < idx; i++) {
					System.out.print(arr[i] + " ");
				}
				System.out.println();
				System.out.println("--------------------------------------------------------------------------------------------------");
//------------------------------------------------------------------------------------------------------------------------------------
			}else {
				System.out.println("숫자를 잘못 입력하셨습니다.");
				
			}
				
		}
	}
		
}

